Mecapitronic/ESP32_Helper/include/ServoAX12.h
#ifndef SERVO_AX12_H
#define SERVO_AX12_H

#include <Dynamixel2Arduino.h>
#include <unordered_map>

#include "ESP32_Helper.h"

namespace ServoAX12
{
    // https://github.com/ROBOTIS-GIT/Dynamixel2Arduino/tree/master

    constexpr size_t MAX_BAUD = 5;
    const BaudRate dxlBaud[MAX_BAUD] = {BaudRate::BAUD_RATE_57600,
                                        BaudRate::BAUD_RATE_115200,
                                        BaudRate::BAUD_RATE_1000000,
                                        BaudRate::BAUD_RATE_2000000,
                                        BaudRate::BAUD_RATE_3000000};

    enum class DxlProtocolVersion
    {
        PROTOCOL_1 = 1,
        PROTOCOL_2 = 2
    };

    constexpr size_t MAX_PROTOCOL = 2;
    const DxlProtocolVersion dxlProtocol[MAX_PROTOCOL] = {DxlProtocolVersion::PROTOCOL_1,
                                                          DxlProtocolVersion::PROTOCOL_2};

    // id vitesse acceleration position command_position ledState
    /**
     * @brief Structure représentant l'état d'un servo moteur.
     * @param id Identifiant du servo moteur.
     * @param vitesse Vitesse maximale du servo moteur en degrés par seconde.
     * @param positionMin Position minimale du servo moteur.
     * @param positionMax Position maximale du servo moteur.
     * @param command_position Position cible du servo moteur.
     * @param ledState État de la LED du servo moteur (allumée en mouvement, éteinte
     * sinon).
     */
    struct ServoMotion
    {
        uint8_t id;
        String name;
        float position;
        uint16_t positionMin;
        uint16_t positionMax;
        float command_position;
        bool IsMoving;
        bool ledState;

        ServoMotion()
        {
            id = (uint8_t)DXL_BROADCAST_ID;
            name = "";
            position = 0;
            positionMin = 0;
            positionMax = 0;
            command_position = 0;
            IsMoving = false;
            ledState = false;
        }

        /**
         * @brief Construct a new Servo Motion object
         *
         * @param _id Identifiant du servo moteur
         * @param _vitesse Vitesse maximale du servo moteur en degrés par seconde
         * @param _acceleration Accélération maximale du servo moteur en degrés par
         * seconde carrée
         */
        ServoMotion(uint8_t _id,
                    String _name,
                    uint16_t _positionMin,
                    uint16_t _positionMax)
        {
            // Initialisation des valeurs
            id = _id;
            name = _name;
            position = 0;
            positionMin = _positionMin;
            positionMax = _positionMax;
            command_position = 0;
            IsMoving = false;
            ledState = false;
        }

        bool operator==(const ServoMotion &other) const
        {
            return id == other.id;
        }
    };

    void Initialisation(HardwareSerial &serial, int8_t rxPin, int8_t txPin, int8_t dirPin, BaudRate baudRate = BaudRate::BAUD_RATE_1000000, DxlProtocolVersion dxlProtocolVersion = DxlProtocolVersion::PROTOCOL_1);
    
    [[noreturn]] void TaskUpdateServo(void *pvParameters);

    void InitAllServo();
    void InitServo(ServoMotion &servo);
    
    void AddServo(uint8_t id, String name, uint16_t positionMin, uint16_t positionMax);

    void StopAllServo();
    void StopServo(ServoMotion &servo);

    void StartAllServo();
    void StartServo(ServoMotion &servo);

    void UpdateAllServo();
    void UpdateServo(ServoMotion &servo);

    bool AreAllServoMoving();
    bool IsServoMoving(uint8_t id);

    void SetServoPosition(uint8_t id, float position);

    void HandleCommand(Command cmd);
    const void PrintCommandHelp();
    int16_t Scan();
    int16_t Scan(DxlProtocolVersion _protocol, BaudRate _dxlBaud);
    void PrintDxlInfo(uint8_t id = DXL_BROADCAST_ID);

    void TeleplotPosition();
    void PrintPosition();
} // namespace ServoAX12

namespace std
{
    template <> struct hash<ServoAX12::ServoMotion>
    {
        std::size_t operator()(const ServoAX12::ServoMotion &k) const
        {
            // Hash only the name, since operator== only compares id
            return std::hash<uint8_t>()(k.id);
        }
    };
} // namespace std
#endif